Revit 2027 API
AnalysisDisplayStyleVectorOrientation Enumeration
 Defines vector orientation for vector settings of analysis display style.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum AnalysisDisplayStyleVectorOrientation
Public Enumeration AnalysisDisplayStyleVectorOrientation
public enum class AnalysisDisplayStyleVectorOrientation
type AnalysisDisplayStyleVectorOrientation
Members
Member name | Value | Description
ArcAroundVectorAxis | 1
Linear | 0
See Also
Reference
Autodesk.Revit.DB.Analysis Namespace